ARMmbed/mbed-os/targets/TARGET_TT/TARGET_TT_M3HQ/device/TOOLCHAIN_IAR/startup_TMPM3HQ.S
                PUBWEAK INTT32A06CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06CCAP0_IRQHandler
                B       INTT32A06CCAP0_IRQHandler

                PUBWEAK INTT32A06CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06CCAP1_IRQHandler
                B       INTT32A06CCAP1_IRQHandler

                PUBWEAK INTT32A07A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07A_IRQHandler
                B       INTT32A07A_IRQHandler

                PUBWEAK INTT32A07ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07ACAP0_IRQHandler
                B       INTT32A07ACAP0_IRQHandler

                PUBWEAK INTT32A07ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07ACAP1_IRQHandler
                B       INTT32A07ACAP1_IRQHandler

                PUBWEAK INTT32A07B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07B_IRQHandler
                B       INTT32A07B_IRQHandler

                PUBWEAK INTT32A07BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07BCAP0_IRQHandler
                B       INTT32A07BCAP0_IRQHandler

                PUBWEAK INTT32A07BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07BCAP1_IRQHandler
                B       INTT32A07BCAP1_IRQHandler

                PUBWEAK INTT32A07C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07C_IRQHandler
                B       INTT32A07C_IRQHandler

                PUBWEAK INTT32A07CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07CCAP0_IRQHandler
                B       INTT32A07CCAP0_IRQHandler

                PUBWEAK INTT32A07CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07CCAP1_IRQHandler
                B       INTT32A07CCAP1_IRQHandler

                PUBWEAK INTPARI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPARI_IRQHandler
                B       INTPARI_IRQHandler

                PUBWEAK INTDMAATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAATC_IRQHandler
                B       INTDMAATC_IRQHandler

                PUBWEAK INTDMAAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAAERR_IRQHandler
                B       INTDMAAERR_IRQHandler

                PUBWEAK INTDMABTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMABTC_IRQHandler
                B       INTDMABTC_IRQHandler

                PUBWEAK INTDMABERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMABERR_IRQHandler
                B       INTDMABERR_IRQHandler

                PUBWEAK INTRTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRTC_IRQHandler
                B       INTRTC_IRQHandler

                PUBWEAK INTRMC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRMC0_IRQHandler
                B       INTRMC0_IRQHandler

                PUBWEAK INTFLCRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLCRDY_IRQHandler
                B       INTFLCRDY_IRQHandler

                PUBWEAK INTFLDRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLDRDY_IRQHandler
                B       INTFLDRDY_IRQHandler

                END
